Python 3.7.3 (v3.7.3:ef4ec6ed12, Mar 25 2019, 21:26:53) [MSC v.1916 32 bit (Intel)] on win32
Type "help", "copyright", "credits" or "license()" for more information.


#format()用法
>>>a="名字是：{0},名字是：{1}"  #占位符的角色
>>> a.format("嗯嗯",20)  #填充，不可随意更改位置
'名字是:嗯嗯,年龄是：20'
>>> b="名字是:{0},年龄是{1},{0}怎样怎样"  #可以反复引用
>>> b
'名字是:{0},年龄是{1},{0}怎样怎样'
>>> b.format("嗯嗯",20)
'名字是:嗯嗯,年龄是20,嗯嗯怎样怎样'
>>> c="名字是{name},年龄是{age}"  #参数名替换，位置可随意更换
>>> c.format(age=20,name="嗯嗯")
'名字是嗯嗯,年龄是20'


#填充与对齐（^、<、>） 
>>> "{:*>8}".format("245")  #*号填充，右对齐
'*****245'
>>> "我是{0},我喜欢数字{1:*>8}".format("嗯嗯","7")
'我是嗯嗯,我喜欢数字*******7'


#数字格式化
>>> a="我是{0},我的存款有{1:.2f}"  #保留小数点后两位数
>>> a.format("嗯嗯",2222.2222)
'我是嗯嗯,我的存款有2222.22'
>>> "{:0>10d}".format(3)  #右对齐，宽度10
'0000000003'
>>> "{:*>10d}".format(3)
'*********3'
'''
  {:+.2f},带符号保留小数点后两位
  {:.0f},不带小数点
  {:0>2d},数字补零（填充左边，宽度为2）
  {:.x<4d},数字不x（填充右边，宽度为4）
  {:.},以逗号分隔的数字格式
  {:.2%}，百分比格式
  {:2e},指数记法
  {:<10d}，左对齐，宽度为10
'''


#可变字符串（字符串属于不可变对象，不支持原地修改）
>>> d="hello en"
>>> import io   #引入
>>> sio = io.StringIO(d)
>>> sio    #新对象
<_io.StringIO object at 0x00C3B6C0>
>>> sio.getvalue()
'hello en'
>>> sio.seek(8)  #移动到指定字符
8
>>> sio.write("g")
1
>>> sio.getvalue()
'hello eng'


>>> a=4
>>> 3<a<10
True
>>> a=0b11001  #0b(二进制)
>>> b=0b01000
>>> a
25
>>> b
8
>>> c= a|b  #按位或
>>> c
25
>>> bin(c)  #转换
'0b11001'
>>> bin(b)
'0b1000'
>>> bin(a^b)  #按位异或
'0b10001'
>>> a=3
>>> a<<2  #左移1位相当于乘以2，左移2位相当于乘以4
12
>>> a=8
>>> a>>1  #右移1位相当于除2
4
>>> 3*4  #3乘4
12
>>> 3**4 #3的4次方
81


